## Titanic competition Sikorskyi ##

**Downloading datasets from kaggle**

Using Google Colabs functions download Kaggle token.

In [ ]:
import pandas as pd
import numpy as np
import re
from google.colab import files
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
import tensorflow as tf
import math
from tensorflow.keras.layers import Dense, Dropout
files.upload()  # here you will download kaggle.json

Saving kaggle.json to kaggle (7).json

UsageError: Line magic function `%install_ext` not found.

Set permission to before downloading Titanic dataset.

In [ ]:
!pip install -q kaggle
!mkdir -p ~/.kaggle
!cp kaggle.json ~/.kaggle/
!ls ~/.kaggle
!chmod 600 /root/.kaggle/kaggle.json  # set permission

Downloading dataset.

In [ ]:
!kaggle competitions download -c titanic

Getting our data.

In [ ]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

**Data transformation**

Befor creating model, it is necessary to analyze, then create function to clean data.

Sibsp and Parch refer to family, so it is logical to replace them with one column and create 'Alone' column for people without family members.

In [ ]:
train['FamilySize'] = train['SibSp'] + train['Parch'] + 1
train[['FamilySize', 'Survived']].groupby(['FamilySize'],
                                          as_index=False).mean()

   FamilySize  Survived
0           1  0.303538
1           2  0.552795
2           3  0.578431
3           4  0.724138
4           5  0.200000
5           6  0.136364
6           7  0.333333
7           8  0.000000
8          11  0.000000

In [ ]:
train['Alone'] = 0
train.loc[train['FamilySize'] == 1, 'Alone'] = 1
train[['Alone', 'Survived']].groupby(['Alone'], as_index=False).mean()

   Alone  Survived
0      0  0.505650
1      1  0.303538

'Fare' has NaNs, so they will be replaced to mean. Also, for future model it is better to replace 'Fare' with its categorical representation.

In [ ]:
train['Fare'] = train['Fare'].fillna(train['Fare'].median())
train['CategoricalFare'] = pd.qcut(train['Fare'], 5)
train[['CategoricalFare', 'Survived']].groupby(
    ['CategoricalFare'], as_index=False).mean()

     CategoricalFare  Survived
0    (-0.001, 7.854]  0.217877
1      (7.854, 10.5]  0.201087
2     (10.5, 21.679]  0.424419
3   (21.679, 39.688]  0.444444
4  (39.688, 512.329]  0.642045

Also, it is very useful to notice whether passanger had a cabin or not and which cabin.

In [ ]:
def get_cabin(cabin):
    for i in str(cabin):
        if i in ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'Z']:
            return i


train['Cabin'] = train['Cabin'].fillna('Z')
train['BL'] = train['Cabin'].apply(get_cabin)
train[['BL', 'Survived']].groupby(['BL'], as_index=False).mean()

  BL  Survived
0  A  0.466667
1  B  0.744681
2  C  0.593220
3  D  0.757576
4  E  0.750000
5  F  0.615385
6  G  0.500000
7  Z  0.299854

In 'Age' we will replace NaNs with mean random and transform to categorical.

In [ ]:
age_avg = train['Age'].mean()
age_std = train['Age'].std()
age_null_count = train['Age'].isnull().sum()
age_null_random_list = np.random.randint(age_avg - age_std, age_avg + age_std,
                                         size=age_null_count)
train['Age'][np.isnan(train['Age'])] = age_null_random_list
train['Age'] = train['Age'].astype(int)
train['CategoricalAge'] = pd.cut(train['Age'], 5)
train[['CategoricalAge', 'Survived']].groupby(['CategoricalAge'],
                                              as_index=False).mean()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  CategoricalAge  Survived
0  (-0.08, 16.0]  0.526316
1   (16.0, 32.0]  0.351724
2   (32.0, 48.0]  0.374046
3   (48.0, 64.0]  0.434783
4   (64.0, 80.0]  0.090909

We can find out different titles of passangers.

In [ ]:
def get_title(name):
    title_search = re.search(r'([A-Za-z]+)\.', name)
    if title_search:
        return title_search.group(1)
    return ""


train['Title'] = train['Name'].apply(get_title)
pd.crosstab(train['Title'], train['Sex'])

So we can transform titles to categorical.

In [ ]:
train['Title'] = train['Title'].replace(['Lady', 'Countess', 'Capt', 'Col',
                                         'Don', 'Dr', 'Major', 'Rev', 'Sir',
                                         'Jonkheer', 'Dona'], 'Rare')

train['Title'] = train['Title'].replace('Mlle', 'Miss')
train['Title'] = train['Title'].replace('Ms', 'Miss')
train['Title'] = train['Title'].replace('Mme', 'Mrs')

train[['Title', 'Survived']].groupby(['Title'], as_index=False).mean()

Column 'Embarked' has NaNs that will be replced with median.

In [ ]:
train['Embarked'] = train['Embarked'].fillna(train['Embarked'].mode()[0])

Adding Ageclass feature.

In [ ]:
train['Age*Class'] = train.Age * train.Pclass
train

Dropping useless columns.

In [ ]:
drop_elements = ['PassengerId', 'Name', 'Ticket', 'Cabin', 'SibSp',
                 'Parch', 'FamilySize']

train = train.drop(drop_elements, axis=1)
train

     Survived  Pclass     Sex  Age  ...  Alone    CategoricalFare  BL CategoricalAge
0           0       3    male   22  ...      0    (-0.001, 7.854]   Z   (16.0, 32.0]
1           1       1  female   38  ...      0  (39.688, 512.329]   C   (32.0, 48.0]
2           1       3  female   26  ...      1      (7.854, 10.5]   Z   (16.0, 32.0]
3           1       1  female   35  ...      0  (39.688, 512.329]   C   (32.0, 48.0]
4           0       3    male   35  ...      1      (7.854, 10.5]   Z   (32.0, 48.0]
..        ...     ...     ...  ...  ...    ...                ...  ..            ...
886         0       2    male   27  ...      1     (10.5, 21.679]   Z   (16.0, 32.0]
887         1       1  female   19  ...      1   (21.679, 39.688]   B   (16.0, 32.0]
888         0       3  female   32  ...      0   (21.679, 39.688]   Z   (16.0, 32.0]
889         1       1    male   26  ...      1   (21.679, 39.688]   C   (16.0, 32.0]
890         0       3    male   32  ...      1    (-0.001, 7.854]   Z   (16.0, 32.0]

[891 rows x 10 columns]

Creating function for data preprocessing and dividing into training and validation data.

In [ ]:
def get_title(name):
    pattern = r'([A-Za-z]+)\.'
    title_search = re.search(pattern, name)
    if title_search:
        return title_search.group(1)
    return ""


def get_cabin(cabin):
    for i in str(cabin):
        if i in ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'Z']:
            return i


def load_data(name):
    dataset = pd.read_csv(name)
    # columns combination
    dataset['FamilySize'] = dataset['SibSp'] + dataset['Parch'] + 1

    # replace value
    dataset['Alone'] = 0
    dataset.loc[dataset['FamilySize'] == 1, 'Alone'] = 1

    # fill Nan with mode
    dataset['Embarked'] = dataset['Embarked'].fillna(
        dataset['Embarked'].mode()[0])

    # fill Nan with median
    dataset['Fare'] = dataset['Fare'].fillna(dataset['Fare'].median())
    # binning with qcut
    dataset['Fare'] = pd.qcut(dataset['Fare'], 4)

    # fill Nan with mean
    age_avg = dataset['Age'].mean()
    age_std = dataset['Age'].std()
    age_null_count = dataset['Age'].isnull().sum()
    rng = np.random.RandomState(42)
    age_null_random_list = rng.uniform(age_avg - age_std, age_avg + age_std,
                                       size=age_null_count)
    dataset['Age'][np.isnan(dataset['Age'])] = age_null_random_list

    # binning with cut
    dataset['Age'] = pd.cut(dataset['Age'], 5)

    # apply regex
    dataset['Title'] = dataset['Name'].apply(get_title)
    # replace
    dataset['Title'] = dataset['Title'].replace(['Lady', 'Countess', 'Capt',
                                                 'Col', 'Don', 'Dr', 'Major',
                                                 'Rev', 'Sir', 'Jonkheer',
                                                 'Dona'], 'Rare')
    # replace
    dataset['Title'] = dataset['Title'].replace(['Mlle', 'Ms'], 'Miss')
    # replace
    dataset['Title'] = dataset['Title'].replace('Mme', 'Mrs')
    # fill nans
    dataset['Title'] = dataset['Title'].fillna(0)
    # fill nans
    dataset['Cabin'] = dataset['Cabin'].fillna('Z')
    # apply replacement
    dataset['BL'] = str(dataset['Cabin'].apply(get_cabin))

    # drop columns
    drop_elements = ['PassengerId', 'Name', 'Ticket', 'SibSp',
                     'Parch', 'FamilySize', 'Cabin']
    dataset = dataset.drop(drop_elements, axis=1)

    # encode labels
    le = LabelEncoder()

    le.fit(dataset['Sex'])
    dataset['Sex'] = le.transform(dataset['Sex'])

    le.fit(dataset['Title'])
    dataset['Title'] = le.transform(dataset['Title'])

    le.fit(dataset['Embarked'].values)
    dataset['Embarked'] = le.transform(dataset['Embarked'].values)

    le.fit(dataset['BL'])
    dataset['BL'] = le.transform(dataset['BL'])

    le.fit(dataset['Fare'])
    dataset['Fare'] = le.transform(dataset['Fare'])

    le.fit(dataset['Age'])
    dataset['Age'] = le.transform(dataset['Age'])
    # creating ageclass feature
    dataset['Age*Class'] = dataset.Age * dataset.Pclass
    le.fit(dataset['Age*Class'])
    dataset['Age*Class'] = le.transform(dataset['Age*Class'])

    return dataset


dataset = load_data("train.csv")
train, val = train_test_split(dataset, test_size=0.1)
features = ['Pclass', 'Sex', 'Age', 'Fare', 'Embarked', 'Alone', 'Title',
            'BL', 'Age*Class']
training_dataset = (
    tf.data.Dataset.from_tensor_slices(
        (
            tf.cast(train[features].values, tf.float32),
            tf.cast(train['Survived'].values, tf.int32)
        )
    )
)
validation_dataset = (
    tf.data.Dataset.from_tensor_slices(
        (
            tf.cast(val[features].values, tf.float32),
            tf.cast(val['Survived'].values, tf.int32)
        )
    )
)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:45: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

**Creating model**

In [ ]:
model = tf.keras.Sequential([
              Dense(12, activation=tf.nn.leaky_relu, input_shape=[9]),
              Dropout(0.2),
              Dense(5, activation=tf.nn.leaky_relu),
              Dense(2, activation=tf.nn.softmax)
])
opt = tf.keras.optimizers.Adam(
    learning_rate=0.01, beta_1=0.9, beta_2=0.999, epsilon=1e-07, amsgrad=True,
    name='Adam'
)
model.compile(optimizer=opt,
              loss=tf.keras.losses.SparseCategoricalCrossentropy(),
              metrics=['accuracy'])

num_train_examples = [i for i, _ in enumerate(training_dataset)][-1] + 1
num_val_examples = [i for i, _ in enumerate(validation_dataset)][-1] + 1
BATCH_SIZE = 256
train_dataset = training_dataset.cache().repeat().shuffle(
    num_train_examples).batch(BATCH_SIZE)
val_dataset = validation_dataset.cache().batch(BATCH_SIZE)
model.fit(train_dataset, validation_data=val_dataset, epochs=1000,
          steps_per_epoch=math.ceil(num_train_examples/BATCH_SIZE))

Predicting and saving.

In [ ]:
model.save('/content/model.h5')
test_ids = pd.read_csv("test.csv")["PassengerId"]
test_dataset = load_data("test.csv")
Y_pred = model.predict(test_dataset)
Y_pred = (Y_pred[:, 1] >= 0.8).astype(int)

submission = pd.DataFrame({
        "PassengerId": test_ids,
        "Survived": Y_pred
    })
submission.to_csv('/content/titanic.csv', index=False)
print('Done!')